package dd_总结;

public class Test1 {
	public static void main(String[] args) {
	/**
	 * Arrays.toString(数组) ==>数组中的连接成字符串
	 * 
	 * Arrays.sort(数组) ==>排序  1.基本类型，优化的快速排序。
	 * 						  2.引用类型，优化的合并排序。
	 * 
	 * Arrays.binarySearch(数组，目标值) ==>二分法查找
	 * 									在有序数组中，查找目标值的位置。找不到，返回负数无意义值

	 * Arrays.copyOf(数组，长度) ==>把数组复制成指定长度的新数组
	 * 						        长度更短，截取前几个位置
	 * 						        长度更长，增加容量
	 * 
	 * Arrays.fill(数组，值) ==>填满指定值
	 * */	
		
	/**
	 * 复制数组
	 * 接受五个参数
	 * System.arraycopy(原数组，原数组起始位置，目标数组，目标数组起始位置，复制的数据数量)
	 * */
		
	//变量
		/**
		 * 1.局部变量
		 * 	定义在方法中，或局部的代码块中
		 * 	局部变量必须手动初始化
		 * 		初始化：第一次赋值时，分配内存
		 * 		int i;
		 * 		print(i); //错，没有初始化
		 * 		i = 5; //第一次赋值，初始化
		 * 		print(i); //可以打印
		 * 		局部变量的作用局、作用范围
		 * 			作用域，到定义的大括号结束
		 * 			作用域内，不能重复定义
		 * 
		 * 
		 * 2.成员变量
		 * 	直接定义在类中
		 * 	成员变量自动初始化成默认值
		 * 	
		 * 	int i;   //默认0
		 *  int[] a; //默认null
		 *  boolean b; //默认false
		 *  
		 * */
	}
	
}
